run_cases/case06_acousticWaves/constant/linearZone/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/linearZone/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    right
    {
        type            patch;
        nFaces          1;
        startFace       499;
    }
    left
    {
        type            patch;
        nFaces          1;
        startFace       500;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          500;
        startFace       501;
    }
    bottom
    {
        type            empty;
        inGroups        1(empty);
        nFaces          500;
        startFace       1001;
    }
    frontBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1000;
        startFace       1501;
    }
)

// ************************************************************************* //
