run_cases/case06_acousticWaves/constant/nonLinearZone/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

massSource
{
    name            sourceTime;
    
    type            scalarCodedSource;
    
    active			on;

    scalarCodedSourceCoeffs
    {
        selectionMode   all;

        fields          (e);
        
        name            sourceTime;

        codeInclude
        #{
        #};

        codeCorrect
        #{
        	//Pout<< "**codeCorrect" << endl;
        #};

        codeAddSup
        #{
            //Pout<< "**codeAddSup**" << endl;
			const Time& time = mesh().time();
			const scalarField& V = mesh_.V();
			const vectorField& C = mesh_.C();
			scalarField& source = eqn.source();
			
			// Mass source
			const vector kp(1.0, 0.0, 0.0);                 // orientation
			const vector xp(0.0, 0.0, 0.0);                 // location
			const scalar ep(4e3);                           // strength
			const scalar ap(Foam::log(2.0)/Foam::sqr(1.0)); // width
			
			// Frequency
			const scalar period(0.1);
			const scalar freq(Foam::constant::mathematical::twoPi/period);
			
			// Add mass source
			const scalarField m(ep*Foam::exp(-ap*sqr((C-xp) & kp)));
			source += m*Foam::sin(freq*time.value())*V;
        #};

        codeConstrain
        #{
            //Pout<< "**codeConstrain**" << endl;
        #};
    }

}

// ************************************************************************* //
