run_cases/case06_acousticWaves/0.orig/nonLinearZone/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    "interface.*"
    {
        type        	mixed;
        refValue		$internalField;
        refGradient		uniform 0;
        valueFraction	uniform 0;
        value			$internalField;
    }
    
    "(top|bottom|frontBack)"
    {
        type            empty;
    }
}


// ************************************************************************* //
